; domain
(define (domain singeBananes)
	(:requirements :strips :typing)
	(:types entity place level)
	(:types actor - entity obj - entity)
	(:predicates 
		(situe ?x - entity ?y - place) 
		(niveau ?x - entity ?y - level) 
		(possede ?x - actor ?y - obj) 
		(mainsVides))
	(:constants 
		singe - actor 
		bananes - obj
		caisse - obj
		haut - level
		bas - level
		a - place
		b - place
		c - place
	)
	(:action seDeplace
		;;; Le singe se déplace de l'emplacement x à l'emplacement b
		:parameters (?x - place ?y - place)
		:precondition (and (situe singe ?x) (niveau singe bas))
		:effect (and (situe singe ?y)
			(not (situe singe ?x)))
	)
	(:action prend
		;;; Le singe prend l'object X (un seul objet)
		:parameters (?x - obj ?n - level ?p - place)
		:precondition (and (mainsVides) 
				(niveau singe ?n) (situe singe ?p) 
				(niveau ?x ?n) (situe ?x ?p))
		:effect (and (possede singe ?x)
			(not (mainsVides))
			(not (situe ?x ?p))
			(not (niveau ?x ?n)))
	)
	(:action depose
		;;; Le singe dépose l'objet X
		:parameters (?x - obj ?p - place ?n - level)
		:precondition (and (possede singe ?x) (situe singe ?p) (niveau singe ?n))
		:effect (and (mainsVides)
			(situe ?x ?p)
			(niveau ?x ?n)
			(not (possede singe ?x)))
	)
	(:action monteCaisse
		;;; Le singe monte sur la caisse
		:parameters (?p - place)
		:precondition (and (situe singe ?p) (niveau singe bas) 
				(situe caisse ?p) (niveau caisse bas)
				(mainsVides))
		:effect (and (niveau singe haut)
			(not (niveau singe bas)))
	)
)

; problem
(define (problem singeBananeProblem)
	(:domain singeBananes)
	(:init (situe singe a) (situe bananes b) (situe caisse c)
		(niveau singe bas) (niveau bananes haut) (niveau caisse bas)
		(mainsVides))
	(:goal (possede singe bananes))
)

; plan
1. (sedeplace a c)
   deleted: (situe singe a)
   added: (situe singe c)
   goals met: 0 of 1
2. (prend caisse bas c)
   deleted: (mainsvides) (situe caisse c) (niveau caisse bas)
   added: (possede singe caisse)
   goals met: 0 of 1
3. (sedeplace c b)
   deleted: (situe singe c)
   added: (situe singe b)
   goals met: 0 of 1
4. (depose caisse b bas)
   deleted: (possede singe caisse)
   added: (mainsvides) (situe caisse b) (niveau caisse bas)
   goals met: 0 of 1
5. (montecaisse b)
   deleted: (niveau singe bas)
   added: (niveau singe haut)
   goals met: 0 of 1
6. (prend bananes haut b)
   deleted: (mainsvides) (situe bananes b) (niveau bananes haut)
   added: (possede singe bananes)
   goals met: 1 of 1
